/* 
  Model.strings
  Secrets

  Created by Paulo Andrade on 23/01/14.
  Copyright (c) 2016 Outer Corner. All rights reserved.
*/


// Generic
"Generic.InvalidValue" = "Invalid value for %@";
"Generic.CreationDate" = "Created";
"Generic.ModificationDate" = "Modified";
"Generic.Notes" = "Notes";
"Generic.Tags" = "Tags";
"Generic.Secret.Single" = "Secret";
"Generic.Secret.Plural" = "Secrets";

/* Item title after a copy */
"Generic.CopiedItemName" = "%@ Copy";

// Credentials
"Credential.Single" = "Login";
"Credential.Plural" = "Logins";
"Credential.New" = "New Login";
"Credential.Items" = "%d login(s)";

"Credential.Properties.identifier" = "Username";
"Credential.Properties.secret" = "Password";
"Credential.Properties.secrets" = "Password History";
"Credential.Properties.services" = "Services";
"Credential.Properties.tags" = "Tags";

// Softwared licenses
"SoftwareLicense.Single" = "Software License";
"SoftwareLicense.Plural" = "Software Licenses";
"SoftwareLicense.Software" = "Software";
"SoftwareLicense.License.Single" = "License";
"SoftwareLicense.New" = "New License";
"SoftwareLicense.Items" = "%d license(s)";

"SoftwareLicense.Properties.key" = "License Key";
"SoftwareLicense.Properties.orderNumber" = "Order Number";
"SoftwareLicense.Properties.orderTotal" = "Order Total";
"SoftwareLicense.Properties.owner" = "License Owner";
"SoftwareLicense.Properties.publisher" = "Publisher";
"SoftwareLicense.Properties.purchaseDate" = "Purchase Date";
"SoftwareLicense.Properties.supportEmail" = "Support E-mail";
"SoftwareLicense.Properties.version" = "Software Version";
"SoftwareLicense.Properties.website" = "Website";

// Wallet
"Wallet.Single" = "Wallet";
"WalletItem.Single" = "Wallet item";
"WalletItem.Plural" = "Wallet items";
"Wallet.Items" = "%d wallet item(s)";

// Bank Account
"BankAccount.Single" = "Bank Account";
"BankAccount.Plural" = "Bank Accounts";
"BankAccount.New" = "New Bank Account";

"BankAccount.Properties.accountHolder" = "Account Holder";
"BankAccount.Properties.bankName" = "Bank";
"BankAccount.Properties.iban" = "IBAN";
"BankAccount.Properties.number" = "Account Number";
"BankAccount.Properties.routingNumber" = "Routing Number";
"BankAccount.Properties.swiftCode" = "SWIFT";

// Credit card
"CreditCard.Single" = "Credit Card";
"CreditCard.Plural" = "Credit Cards";
"CreditCard.New" = "New Credit Card";

"CreditCard.Brand.visa" = "Visa";
"CreditCard.Brand.mastercard" = "MasterCard";
"CreditCard.Brand.amex" = "American Express";
"CreditCard.Brand.diners" = "Diners Club";
"CreditCard.Brand.discover" = "Discover";
"CreditCard.Brand.jcb" = "JCB";
"CreditCard.Brand.solo" = "Solo";
"CreditCard.Brand.maestro" = "Maestro";
"CreditCard.Brand.visaelectron" = "Visa Electron";
"CreditCard.Brand.other" = "Other";

"CreditCard.Properties.pan" = "Card Number";
"CreditCard.Properties.cardholder" = "Card Holder";
"CreditCard.Properties.expirationDate" = "Expiration Date";
"CreditCard.Properties.brand" = "Brand";
"CreditCard.Properties.pin" = "PIN";
"CreditCard.Properties.securityCode" = "Security Code";

"CreditCard.Errors.InvalidPAN" = "Credit card number must be a sequence of digits";

// Notes
"Note.Single" = "Note";
"Note.Plural" = "Notes";
"Note.New" = "New Note";
"Note.Items" = "%d note(s)";

// Service
"Service.URL" = "URL";

"Service.Properties.address" = "address";

"Service.Errors.InvalidAddress" = "A service address must be a valid URL";

// One-Time Passwords
"OneTimePassword.Single" = "One-Time Password";
"OneTimePassword.Plural" = "One-Time Passwords";
"OneTimePassword.Seed.Long" = "One-Time Password secret";
"OneTimePassword.Seed.Short" = "OTP secret";
